export default {
  systemTitle: '🚀 Nextra 启动模板',
  banner: {
    title: '👋 嘿，欢迎来到 Next.js 起步模板!',
    more: '了解详情',
  },

  badgeTitle: '轻量级、开箱即用 🎉',
  featureSupport: `🔥 现在支持 {{feature}}！`,
  lastUpdated: '最后更新于:',

  getStarted: '开始使用',

  themeSwitcher: {
    light: '浅色模式',
    dark: '深色模式',
    lightAria: '切换到浅色模式',
    darkAria: '切换到深色模式',
  },

  featureList: [
    {
      title: '客户定制软件设计及开发',
      description: '我们特别擅长ERP（企业资源计划）和CRM（客户关系管理）系统的开发。我们深知每个企业在运营和管理上的独特需求，因此我们提供高度个性化的ERP和CRM解决方案，确保系统的灵活性、可扩展性和安全性。',
    },
    {
      title: '主页设计及前端后端技术开发',
      description: '在数字化时代，您的公司主页是连接客户的桥梁。我们提供从零开始的全面网站设计与开发服务，保证您网站的美观、现代以及功能强大，支持多设备的无缝运行，并提供稳定的托管和维护服务。',
    },
    {
      title: 'AI相关软件设计开发',
      description: '我们提供广泛的AI软件设计开发服务，从机器学习到深度学习，以及流程自动化，帮助您的企业提升效率与竞争力。我们的AI解决方案涵盖从创建智能聊天机器人到开发复杂的软件系统，以预测客户行为、分析数据洞察，推动业务创新。',
    },
    {
      title: '移动平台应用设计开发',
      description: '我们专注于设计和开发高品质的移动应用程序，包括iOS和Android平台，以及Line和微信等社交平台应用。我们的解决方案注重用户体验，支持多种通信功能和业务集成，帮助企业提高客户互动与参与度。',
    },
    {
      title: '中日英语教育相关软件产品开发',
      description: '教育是未来的基石，我们开发面向中、日、英语学习的教育软件产品。我们的解决方案支持互动学习和个性化教学，促进多语言环境中的交流与文化理解，帮助学习者更有效地掌握语言技能。',
    },
    {
      title: '全面的业务支持与服务',
      description: '我们提供全面的业务支持与服务，确保您的系统和应用在全生命周期内保持高效运行。我们的服务包括技术支持、系统维护、用户培训以及业务咨询等，帮助您实现业务目标并提升市场竞争力。',
    },
    // {
    //   title: '暗黑模式',
    //   description: '支持暗黑模式，提供更好的夜间使用体验',
    // },
    // {
    //   title: '丰富组件 & 支持自由扩展',
    //   description: '提供丰富的预置组件，并支持灵活的自定义扩展',
    // },
    // {
    //   title: '轻量化设计',
    //   description: '采用轻量化设计，精简项目设置，专注于内容编写',
    // },
  ],
  featuresDesc: '轻松构建现代应用，快速启动您的开发流程',
  faqs: [
    {
      question: '这个启动模板支持哪些框架和技术栈？',
      answer: '本启动模板支持 Next.js 和 Nextra，并集成了 Tailwind CSS、Framer Motion、Shadcn UI 组件等现代开发技术栈。',
    },
    {
      question: '我如何开始使用这个模板进行开发？',
      answer: '只需克隆我们的 GitHub 仓库并按照文档中的步骤运行安装命令，即可开始使用本模板进行开发。',
    },
    {
      question: '这个模板适合哪些类型的项目？',
      answer: '该模板适合用于创建快速、高效的现代 Web 应用程序，包括企业站点、个人博客、电子商务平台等。',
    },
    {
      question: '如何添加或修改项目中的组件？',
      answer: '可以使用提供的组件库，按照文档中的说明进行自定义和扩展，以适应您的具体需求。',
    },
    {
      question: '模板是否提供多语言支持？',
      answer: '是的，模板内置国际化 (i18n) 功能，可以轻松添加和管理多语言内容，扩大应用的国际用户群。',
    },
    {
      question: '如何获得技术支持或帮助？',
      answer: '如果在使用过程中遇到问题，请通过 GitHub @pdsuwwz 与我们联系。',
    },
    {
      question: '🐒 作者现在最缺什么？',
      answer: '缺 Star！⭐️ 每天写代码写到秃头，就指望这点 Star 安慰我受伤的心灵... 社畜的快乐就这么简单！',
    },
  ],

}
